app/controllers/adverts_controller.rb

  def index
    @advert = Advert.all
---
SELECT "adverts".* FROM "adverts"

  def create
    @categories = Category.all
    @advert = Advert.new(advert_params)
    @advert.check_list = CheckList.new
    if @advert.save
---
SELECT "categories".* FROM "categories"
INSERT INTO "adverts" ("category_id", "year", "seller", "phone", "url", "price", "vin", "city", "notes", "complectation", "owners", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
INSERT INTO "check_lists" ("advert_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["advert_id", 13], ["created_at", "2019-06-27 08:42:30.151425"], ["updated_at", "2019-06-27 08:42:30.151425"]]

  def show
    @advert = Advert.find(params[:id])
---
SELECT  "adverts".* FROM "adverts" WHERE "adverts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    @advert = Advert.find(params[:id])
    @categories = Category.all
---
SELECT  "adverts".* FROM "adverts" WHERE "adverts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"

  def update
    if @advert = Advert.update(advert_params)
---
UPDATE "adverts" SET "phone" = $1, "price" = $2, "updated_at" = $3 WHERE "adverts"."id" = $4  [["phone", "+79867441984"], ["price", 1312], ["updated_at", "2019-06-27 08:28:36.669121"], ["id", 12]]

  def destroy
    @advert = Advert.find(params[:id])
    @advert.destroy
---
SELECT  "adverts".* FROM "adverts" WHERE "adverts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "adverts" WHERE "adverts"."id" = $1  [["id", 10]]