app/controllers/categories_controller.rb

  def create
    if @category = Category.create!(category_params)
---
INSERT INTO "categories" ("brand", "model") VALUES ($1, $2) RETURNING "id"  [["brand", "Ford"], ["model", "Bayard"]]

  def update
    if @category = Category.update(category_params)
---
UPDATE "categories" SET "model" = $1 WHERE "categories"."id" = $2  [["model", "Vest"], ["id", 11]]