app/controllers/check_lists_controller.rb

SELECT "check_lists".* FROM "check_lists"
---
  def index
    @check_lists = CheckList.all

SELECT  "check_lists".* FROM "check_lists" WHERE "check_lists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @check_list = CheckList.find(params[:id])

SELECT  "check_lists".* FROM "check_lists" WHERE "check_lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @check_list = CheckList.find(params[:id])

SELECT  "check_lists".* FROM "check_lists" WHERE "check_lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "check_lists" SET "spending" = $1, "condicion" = $2, "service" = $3, "painted" = $4, "body_repair" = $5, "notes" = $6, "updated_at" = $7 WHERE "check_lists"."id" = $8  [["spending", "Не требует"], ["condicion", ""], ["service", "s"], ["painted", ""], ["body_repair", ""], ["notes", ""], ["updated_at", "2019-06-27 08:11:02.994637"], ["id", 6]]
---
  def update
    @check_list = CheckList.find(params[:id])
    @check_list.update(check_list_params)

SELECT  "check_lists".* FROM "check_lists" WHERE "check_lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "check_lists" WHERE "check_lists"."id" = $1  [["id", 2]]
---
  def destroy
    @check_list = CheckList.find(params[:id])
    @check_list.destroy